src/Enums/СпособРаботыСEDT/СпособРаботыСEDT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособРаботыСEDT</name>
  <enumValues>
    <name>ring</name>
  </enumValues>
  <enumValues>
    <name>CLI</name>
  </enumValues>
</mdclass:Enum>

src/CommonForms/Настройки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Поз = Найти(СтрокаСоединения, "File=""");
	Если Поз = 0 Тогда                       
		Предупреждение(НСтр("ru = 'Неверный тип ИБ'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтрокаСоединения = Сред(СтрокаСоединения, Поз + 6);
	Поз = Найти(СтрокаСоединения, """;");
	Если Поз = 0 Тогда                       
		Предупреждение(НСтр("ru = 'Неверный путь к файловой ИБ'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	КаталогИБ = Лев(СтрокаСоединения, Поз - 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЗавершитьРаботуСистемы();
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	Элементы.ПутьКУтилитеEDT.Видимость = ЗначениеЗаполнено(Константы.СпособРаботыСEDT);
	Элементы.ВерсияEDT.Видимость = (Константы.СпособРаботыСEDT = Перечисления.СпособРаботыСEDT.ring);
КонецПроцедуры

&НаКлиенте
Процедура СпособРаботыСEDTПриИзменении(Элемент)
	Если Константы.СпособРаботыСEDT = ПредопределенноеЗначение("Перечисление.СпособРаботыСEDT.ring") Тогда
		Константы.ПутьКУтилитеEDT = "ring";
	ИначеЕсли Константы.СпособРаботыСEDT = ПредопределенноеЗначение("Перечисление.СпособРаботыСEDT.CLI") Тогда
		Константы.ПутьКУтилитеEDT = "1cedtcli";
	Иначе
		Константы.ПутьКУтилитеEDT = "";
	КонецЕсли;
	
	Если Константы.СпособРаботыСEDT <> ПредопределенноеЗначение("Перечисление.СпособРаботыСEDT.ring") Тогда
		Константы.ВерсияEDT = "";
	КонецЕсли;
	
	НастроитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКУтилитеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработчикПродолжения = Новый ОписаниеОповещения("ПутьКУтилитеПослеВыбора", ЭтаФорма);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПолноеИмяФайла = Константы.ПутьКУтилитеEDT;
	ДиалогВыбораФайла.Показать(ОбработчикПродолжения);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКУтилитеПослеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ПутьКУтилитеEDT = ВыбранныеФайлы[0];
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяКомандаДвухстороннегоСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработчикПродолжения = Новый ОписаниеОповещения("ОсновнаяКомандаДвухстороннегоСравненияПослеВыбора", ЭтаФорма);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Показать(ОбработчикПродолжения);
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяКомандаДвухстороннегоСравненияПослеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ОсновнаяКомандаДвухстороннегоСравненияравнения = ВыбранныеФайлы[0];
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяКомандаТрехстороннегоСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработчикПродолжения = Новый ОписаниеОповещения("ОсновнаяКомандаТрехстороннегоСравненияПослеВыбора", ЭтаФорма);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Показать(ОбработчикПродолжения);
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяКомандаТрехстороннегоСравненияПослеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ОсновнаяКомандаТрехстороннегоСравненияравнения = ВыбранныеФайлы[0];
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УдалитьФайлы(ОбщегоНазначения.ДобавитьЧастиПути(КаталогИБ, "edt"));
	УдалитьФайлы(ОбщегоНазначения.ДобавитьЧастиПути(КаталогИБ, "export"));
КонецПроцедуры
